# Getting started with pandas
# Pandas入门

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

'C:\\Users\\MappingLab-lxy\\pydata-book\\branches\\1st-edition'

## Introduction to pandas data structures
## 介绍Pandas的数据结构

### Series
类似一维数组，由一组数据和索引组成

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
print(obj.values)
obj.index

[ 4  7 -5  3]

RangeIndex(start=0, stop=4, step=1)

In [7]:
#可以对数据点标记为指定的索引
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [12]:
#可以根据索引选择单个值
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [13]:
#可以进行布尔运算
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
#广播
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
#可以当做字典使用
'b' in obj2

True

In [18]:
'e' in obj2

False

In [20]:
#可以通过字典创建Series，使用Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
#有索引的值会被找出并放置到响应的位置上，找不到索引的值设为NaN
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
#判断是否是缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
#自动对齐索引，即索引相同的值相加
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
#索引和series都有一个name属性
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
#可以通过幅值直接修改索引
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame
表格型的数据结构，每列可以是不同的值类型。   
DataFrame既有行索引也有列索引，可以看做许多共用行索引/列索引的Series   
通过层次化的表格型结构，可以将其表示为更高维度的数据

#### 创建一个DataFrame
最简单的方法就是使用多个等长列表/Numpy数组组成的字典

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [37]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [39]:
#可以指定col的顺序
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [41]:
#指定列索引
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [51]:
#不推荐使用ix
#使用index索引使用loc
#使用value索引使用iloc
print(frame2.loc['three'])
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [52]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [53]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [55]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [60]:
#增加一新的一列，值等于frame2.state == 'Ohio'
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [61]:
#删除列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [65]:
#使用嵌套字典创建DataFrame，外层作为Col,内层作为index
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [66]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [67]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [68]:
#如果显式指定了index则以显式指定的为准
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [69]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [70]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [72]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects
### 索引对象

In [77]:
obj = Series(range(3), index=['a', 'b', 'c'])
#注意这里index是obj.index的引用而不是副本
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [78]:
index[1:]

Index(['b', 'c'], dtype='object')

In [79]:
#index是无法修改的
index[1] = 'd'

TypeError: Index does not support mutable operations

In [80]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [81]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [82]:
'Ohio' in frame3.columns

True

In [83]:
2003 in frame3.index

False

## Essential functionality
## 基本功能

### Reindexing
### 重新索引

In [84]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [85]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [88]:
#fill_value将没有的值填充为0
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [89]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
#ffill 将没有的值填充为他的前一个值 
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [92]:

frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [91]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [93]:
#重新列索引
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [95]:
#虽然可以同时修改行索引和列索引，但插值只能按行应用
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

ValueError: index must be monotonic increasing or decreasing

In [97]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis
### 丢弃指定轴上的项

In [98]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
#使用drop(index)
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [100]:
#丢弃多个需要传入一个列表
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [101]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [102]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [107]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [109]:
#drop并未在原表格上操作，而是返回了一个删除了对应元素的新数组
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Indexing, selection, and filtering
### 索引，选择，过滤

In [110]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [111]:
obj[1]

1.0

In [112]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [113]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [114]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [115]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [116]:
#利用index索引时，是两边都包含的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [117]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [118]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [126]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [127]:
#索引的是行
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [128]:
#改为index则行不通
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [130]:
data[data < 5] = 0

In [131]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [138]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [139]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [142]:
#为了避免引起误会即行索引/列索引也为整数，ix的索引带整数容易出错
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [143]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment
### 算术运算和数据对齐
可以对不同索引对的的对象进行加减，若存在不同的索引对，则结果的的索引就是索引对的并集   

在一方没有对应索引对的地方设为了NA

In [151]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [152]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [153]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [154]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [155]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [156]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [157]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [158]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [159]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [160]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [162]:
#同样可以使用fill_value来指定填充值
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [164]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

add()，sub()，div(),mul()

#### Operations between DataFrame and Series
#### DataFrame和Series间的运算

In [165]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [166]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [168]:
#每行都减去了一维数组
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [170]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [178]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [173]:
#效果与数组一致，每行减去了series
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [179]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [180]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [181]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [182]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping
### 函数应用和映射

In [183]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [184]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [185]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [186]:
f = lambda x: x.max() - x.min()

In [188]:
#通过apply，将函数应用到表中由各行或各列形成的一维数组上
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [190]:
#指定方向
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [191]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [192]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [196]:
#Series才可用map
#DataFrame叫applymap
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking
### 排序和排名
根据索引排序sort_index()

In [197]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [198]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [200]:
#指定排序的轴
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [201]:
#禁用升序，即降序
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [205]:
#Series的order方法被统一为了sort_index或sort_values
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [208]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
#Nan值会被放在末尾
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [209]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [212]:
#根据b的value来排序
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [216]:
#优先排序a，若a大小相等时，再根据b排列
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [219]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
#rank为排名，即根据值的大小来排名，如小明考了100分，小红98，小黑88，则小黑的rank为1.0，小红为2.0，小明为3.0
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [220]:
#method='first'表示，值相同时，先出现的rank低一些
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [222]:
#max相当于把原1.5的rank进位为2，即进位
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [223]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [225]:
#按照列索引进行rank
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values
### 带有重复值的轴索引

In [226]:
#轴索引是可以重复的
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [ ]:
obj.index.is_unique

In [229]:
#如果索引对应多个值，则返回一个series
obj['a']

a    0
a    1
dtype: int32

In [230]:
obj['c']

4

In [231]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [233]:
df.loc['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics
## 汇总和计算描述统计

In [234]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [235]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [238]:
#按照某个方向，计算和
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [240]:
#将NaN也计算进去
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [242]:
#最大值的列
df.idxmax()

one    b
two    d
dtype: object

In [244]:
#累加，n+1行的值等于前n行的累加
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [246]:
#生成对表格统计报告
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [247]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance
### 相关系数和方差

In [294]:
from pandas_datareader import data, wb
import datetime
#原书中的数据过于久远，无法获取
start = '1/1/2015'
end ='1/1/2017'
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker,'yahoo',start, end)

In [296]:
all_data['IBM'][:10]

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2014-12-31,160.410004,161.500000,160.380005,160.440002,144.075256,4011900
2015-01-02,161.309998,163.309998,161.000000,162.059998,145.530060,5525500
2015-01-05,161.270004,161.270004,159.190002,159.509995,143.240128,4880400
2015-01-06,159.669998,159.960007,155.169998,156.070007,140.151047,6146700
2015-01-07,157.199997,157.199997,154.029999,155.050003,139.235062,4701800
2015-01-08,156.240005,159.039993,155.550003,158.419998,142.261337,4236800
2015-01-09,158.419998,160.339996,157.250000,159.110001,142.880966,4484800
2015-01-12,159.000000,159.250000,155.759995,156.440002,140.483292,4182800
2015-01-13,157.259995,159.970001,155.679993,156.809998,140.815552,4377500
2015-01-14,154.860001,156.490005,153.740005,155.800003,139.908569,4690300

In [287]:
#dict.items（）返回一个迭代器可以用于for循环
price = DataFrame({ tic: data['Adj Close'] for tic, data in all_data.items() })
volume = DataFrame({tic:data['Volume']
                    for tic, data in all_data.items()})

In [293]:
print(price.head())
print((145.530060-144.075256)/144.075256)
#计算百分数变化,v2-v1/v1
returns = price.pct_change()
returns.head()

                  AAPL        GOOG         IBM       MSFT
Date
2014-12-31  104.488365  523.521423  144.075256  43.050045
2015-01-02  103.494423  521.937744  145.530060  43.337357
2015-01-05  100.578819  511.057617  143.240128  42.938828
2015-01-06  100.588287  499.212799  140.151047  42.308598
2015-01-07  101.998764  498.357513  139.235062  42.846146
0.010097528474979741

                AAPL      GOOG       IBM      MSFT
Date
2014-12-31       NaN       NaN       NaN       NaN
2015-01-02 -0.009512 -0.003025  0.010098  0.006674
2015-01-05 -0.028172 -0.020846 -0.015735 -0.009196
2015-01-06  0.000094 -0.023177 -0.021566 -0.014677
2015-01-07  0.014022 -0.001713 -0.006536  0.012705

In [302]:
#corr计算相关系数，这里是计算MSFT和IBM的皮尔逊相关系数，series的corr()
returns.MSFT.corr(returns.IBM)

0.49741946545500398

In [303]:
#同理 协方差
returns.MSFT.cov(returns.IBM)

0.00010340560329899688

In [304]:
#返回完整的相关系数
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.410315  0.420020  0.510069
GOOG  0.410315  1.000000  0.401443  0.582085
IBM   0.420020  0.401443  1.000000  0.497419
MSFT  0.510069  0.582085  0.497419  1.000000

In [305]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000249  0.000103  0.000086  0.000130
GOOG  0.000103  0.000252  0.000082  0.000149
IBM   0.000086  0.000082  0.000167  0.000103
MSFT  0.000130  0.000149  0.000103  0.000260

In [307]:
#每一列与指定series的相关系数
returns.corrwith(returns.IBM)

AAPL    0.420020
GOOG    0.401443
IBM     1.000000
MSFT    0.497419
dtype: float64

In [311]:
#若传入DataFrame则会按索引对齐
returns.corrwith(volume)

AAPL   -0.129439
GOOG    0.143737
IBM    -0.248464
MSFT   -0.089499
dtype: float64

### Unique values, value counts, and membership
### 唯一值，值计数，及成员资格

In [312]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [313]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [314]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [315]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [318]:
#是否在Series中
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [319]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [320]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [322]:
#结果解释，行索引为DataFrame中所有的值，列索引对应的是值出现的次数
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data
## 处理缺失值

In [323]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [326]:
#使用isnull()判断是否为NA值
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [327]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data
### 滤除缺失数据

In [332]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
#Series使用dropna()丢弃
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [333]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [337]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()#同理dataframe，直接删去了含有NA的行
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [338]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [342]:
data.dropna(how='all')#仅将一行全是NA的丢掉

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [343]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [344]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [351]:
df = DataFrame(np.random.randn(7, 3))
#此处是一个为什么要区分loc和iloc的范例，此处两者均可使用，非常容易出错
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df

          0         1         2
0  0.850591       NaN       NaN
1  0.188211       NaN       NaN
2  2.003697       NaN       NaN
3  0.118110       NaN  0.584970
4  0.152677       NaN -0.562540
5 -0.032664 -0.929006 -0.482573
6 -0.036264  1.095390  0.980928

In [355]:
df.dropna(thresh=2)#一行中有2个非NA值就保留

          0         1         2
3  0.118110       NaN  0.584970
4  0.152677       NaN -0.562540
5 -0.032664 -0.929006 -0.482573
6 -0.036264  1.095390  0.980928

### Filling in missing data
### 填充缺失数据

In [357]:
df.fillna(0)#将NA置为0

          0         1         2
0  0.850591  0.000000  0.000000
1  0.188211  0.000000  0.000000
2  2.003697  0.000000  0.000000
3  0.118110  0.000000  0.584970
4  0.152677  0.000000 -0.562540
5 -0.032664 -0.929006 -0.482573
6 -0.036264  1.095390  0.980928

In [360]:
df.fillna({1: 0.5, 2: -1})#不同的列填充不同的值，索引为1的列填充0.5，注意这里是字典而不是切片

          0         1         2
0  0.850591  0.500000 -1.000000
1  0.188211  0.500000 -1.000000
2  2.003697  0.500000 -1.000000
3  0.118110  0.500000  0.584970
4  0.152677  0.500000 -0.562540
5 -0.032664 -0.929006 -0.482573
6 -0.036264  1.095390  0.980928

In [362]:
# always returns a reference to the filled object，通常fillna返回一个新对象，但可以用下面的方法对现有对象进行修改
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.850591  0.000000  0.000000
1  0.188211  0.000000  0.000000
2  2.003697  0.000000  0.000000
3  0.118110  0.000000  0.584970
4  0.152677  0.000000 -0.562540
5 -0.032664 -0.929006 -0.482573
6 -0.036264  1.095390  0.980928

In [364]:
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df

          0         1         2
0  0.107657 -0.606545 -0.417064
1 -0.017007 -1.224145 -1.800840
2  1.634736       NaN  0.457940
3  0.555154       NaN -0.440554
4 -0.301350       NaN       NaN
5  1.320566       NaN       NaN

In [365]:
df.fillna(method='ffill')

          0         1         2
0  0.107657 -0.606545 -0.417064
1 -0.017007 -1.224145 -1.800840
2  1.634736 -1.224145  0.457940
3  0.555154 -1.224145 -0.440554
4 -0.301350 -1.224145 -0.440554
5  1.320566 -1.224145 -0.440554

In [367]:
df.fillna(method='ffill', limit=2)#向前两个对象

          0         1         2
0  0.107657 -0.606545 -0.417064
1 -0.017007 -1.224145 -1.800840
2  1.634736 -1.224145  0.457940
3  0.555154 -1.224145 -0.440554
4 -0.301350       NaN -0.440554
5  1.320566       NaN -0.440554

In [368]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())#填入均值

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing
## 层次化索引
建立多个级别的索引，即一个项目或一行对应多个索引

In [370]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.426986
   2   -1.563740
   3   -0.367488
b  1    1.045913
   2    1.219954
   3   -0.247699
c  1   -0.416232
   2   -0.116747
d  2   -1.844788
   3    2.068708
dtype: float64

In [371]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [372]:
data['b']

1    1.045913
2    1.219954
3   -0.247699
dtype: float64

In [373]:
data['b':'c']

b  1    1.045913
   2    1.219954
   3   -0.247699
c  1   -0.416232
   2   -0.116747
dtype: float64

In [377]:
data.loc[['b', 'd']]#可以在外层索引选择

b  1    1.045913
   2    1.219954
   3   -0.247699
d  2   -1.844788
   3    2.068708
dtype: float64

In [378]:
data[:, 2]#也可在内层索引选择

a   -1.563740
b    1.219954
c   -0.116747
d   -1.844788
dtype: float64

In [380]:
data.unstack()#将不同的索引分别置为行索引和列索引，取并集，成为了一个DateFrame

          1         2         3
a  0.426986 -1.563740 -0.367488
b  1.045913  1.219954 -0.247699
c -0.416232 -0.116747       NaN
d       NaN -1.844788  2.068708

In [382]:
data.unstack().stack()#stack为逆运算

a  1    0.426986
   2   -1.563740
   3   -0.367488
b  1    1.045913
   2    1.219954
   3   -0.247699
c  1   -0.416232
   2   -0.116747
d  2   -1.844788
   3    2.068708
dtype: float64

In [383]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [385]:
frame.index.names = ['key1', 'key2']#DataFrame中每个轴都可以有分层索引
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [386]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels
### 重排分级顺序

In [387]:
#根据name交换索引
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [392]:
frame.sort_index(level=1)#根据第二个层次的索引排序表格

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [393]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level
### 根据级别汇总统计

In [394]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [395]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns
### 使用DataFrame的列作为行索引

In [397]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [400]:
frame2 = frame.set_index(['c', 'd'])#默认情况下，作为行索引的列会被移除
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [401]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [402]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics
## 其他话题

### Integer indexing
### 整数索引

In [409]:
ser = Series(np.arange(3.))
#本身就是整数索引时无法直接使用ser[]
ser.iloc[-1]

2.0

In [410]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [412]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
print(ser2)
ser2[-1]#当索引为非整数索引时可以使用整数索引

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [418]:
print(ser.iloc[:1])
ser.loc[:1]#这里是不把1当做整数来索引，所以包括1

0    0.0
dtype: float64

0    0.0
1    1.0
dtype: float64

In [419]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [424]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
print(frame)
frame.iloc[0]#第0行，的第0列值为0，第1列值为1
frame.iloc[1]#第1行，的第0列值为2，第1列值为3

   0  1
2  0  1
0  2  3
1  4  5

0    2
1    3
Name: 0, dtype: int32

### Panel data
### 面板数据

In [429]:
from pandas_datareader import data, wb

pdata = pd.Panel(dict((stk, data.DataReader(stk,'yahoo'))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/DELL?period1=1262275200&period2=1513871999&interval=1d&events=history&crumb=zfWf7Qcm0ns

In [ ]:
pdata

In [ ]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

In [ ]:
pdata.ix[:, '6/1/2012', :]

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [ ]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

In [ ]:
stacked.to_panel()